* Work log
** General time
   :LOGBOOK:
   CLOCK: [2018-01-11 Thu 19:10]--[2018-01-12 Fri 00:10] =>  5:00
   CLOCK: [2018-01-10 Wed 20:06]--[2018-01-11 Thu 00:12] =>  4:06
   CLOCK: [2018-01-09 Tue 18:39]--[2018-01-09 Tue 23:41] =>  5:02
   CLOCK: [2018-01-08 Mon 22:10]--[2018-01-09 Tue 01:58] =>  3:48
   CLOCK: [2018-01-08 Mon 19:20]--[2018-01-08 Mon 21:03] =>  1:43
   CLOCK: [2018-01-08 Mon 18:35]--[2018-01-08 Mon 18:54] =>  0:19
   CLOCK: [2018-01-07 Sun 19:36]--[2018-01-07 Sun 20:35] =>  0:59
   CLOCK: [2018-01-07 Sun 16:52]--[2018-01-07 Sun 19:00] =>  2:08
   CLOCK: [2018-01-07 Sun 14:06]--[2018-01-07 Sun 14:56] =>  0:50
   CLOCK: [2018-01-05 Fri 20:12]--[2018-01-06 Sat 01:12] =>  5:00
   :END:

* Todo
** Features
*** TODO teleport survivors in enclosed areas to broken walls
    flood fill to find a broken wall they can actually get to, then
    teleport 'em there.
*** TODO flood the map when you win
    tick the molasses real fast or somethin.
*** TODO fizzle droplets in enclosed areas
    wait droplets can't land on enclosed areas, or are we saying if
    one droplet breaks a wall then another goes through the gap and
    hits a floor tile it fizzles?
    
    ok i think this is done?
*** TODO it's hard to tell that diagonals aren't connected
*** DONE remove non-enclosed molasses at the end of each round 
** Bugs
*** TODO if you enclose molasses in an area you destroy it
    if the molasses starts in the center you can just remove it by
    enclosing it. this is harder than it seems because you can have
    separate enclosed areas and i need to filling only the one with molasses in.
** Done
*** DONE people to rescue
*** DONE fix droplets being able to land on molasses
*** DONE can't build in enclosed areas
    jesus christ my brain is fried i cannot figure out the conditional
    for this.
*** DONE rotation
*** DONE if you spam click you can build more walls than you should be able to
*** DONE shuffle the pieces
*** DONE get one following the mouse with snapping n stuff
*** DONE drop delay
*** DONE molasses!! - done for now..
*** DONE 1 tile border around the edge to stop game breaking stuff
*** DONE droplets


* Ideas etc
** The Great Molasses Flood
** General game flow
   1. Building phase, trying to rescue people.
   2. Molasses spreads
   3. Droplets get launched
   4. Counter-attack
** Molasses starts off in one of the corners, spreads according to some simple rules
